Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: See also the <<resource-metadata-properties>> section about accessing the protected resource metadata.
ja_jp: 保護されたリソースのメタデータへのアクセスについては、 <<resource-metadata-properties>> セクションも参照してください。

source: See also the <<token-binding>> section.
ja_jp: <<token-binding>> セクションも参照してください。

source: See also the <<token-state-manager>> section for more information about managing session cookies.
ja_jp: セッション Cookie の管理についての詳細は、<<token-state-manager>> セクションも参照してください。

source: See also the xref:security-authorize-web-endpoints-reference.adoc#custom-http-security-policy[Custom HttpSecurityPolicy] section of the Authorization of web endpoints guide for more information about custom policies.
ja_jp: カスタムポリシーの詳細については、Web エンドポイントの認可ガイドの xref:security-authorize-web-endpoints-reference.adoc#custom-http-security-policy[カスタム HttpSecurityPolicy] セクションも参照してください。

source: See also the xref:security-authorize-web-endpoints-reference.adoc#custom-http-security-policy[HttpSecurityPolicy] and xref:security-authorize-web-endpoints-reference.adoc#permission-checker[PermissionChecker] sections for more authorization control options.
ja_jp: その他の認可制御オプションについては、 xref:security-authorize-web-endpoints-reference.adoc#custom-http-security-policy[HttpSecurityPolicy] および xref:security-authorize-web-endpoints-reference.adoc#permission-checker[PermissionChecker] セクションも参照してください。

source: See also the xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 providers] section for more information.
ja_jp: 詳細は xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 プロバイダー] セクションも参照してください。

source: See also the xref:security-oidc-configuration-properties-reference.adoc[OIDC configuration properties] reference guide.
ja_jp: xref:security-oidc-configuration-properties-reference.adoc[OIDC設定プロパティ] のリファレンスガイドもご参照ください。

source: See also the xref:security-oidc-expanded-configuration.adoc[Expanded OIDC Configuration Reference] for an expanded, detailed explanation of OIDC configuration properties and their typical, recommended combinations.
ja_jp: OIDC 設定プロパティーとその典型的な推奨される組み合わせについて、より詳細な説明は、xref:security-oidc-expanded-configuration.adoc[詳細な OIDC 設定リファレンス] も参照してください。

source: See also xref:getting-started-testing.adoc#test-from-ide[Running `@QuarkusTest` from an IDE].
ja_jp: xref:getting-started-testing.adoc#test-from-ide[IDEから`@QuarkusTest` を実行] も参照してください。

source: See also xref:hibernate-orm-panache.adoc#mocking_active_record[Simplified Hibernate ORM with Panache - Using the active record pattern] for more information.
ja_jp: 詳細については、 xref:hibernate-orm-panache.adoc#mocking_active_record[Panache でシンプルになった Hibernate ORM - アクティブレコードパターンを使用する] も参照してください。

source: See also: <<getting-started-testing.adoc#test-from-ide,Running `@QuarkusTest` from an IDE>>
ja_jp: こちらも参照: <<link:getting-started-testing.html#test-from-ide[IDE から `@QuarkusTest` を実行する >>

source: See basic Quarkus CLI usage first:
ja_jp: 最初に、Quarkus CLIの基本的な使い方を参照してください：

source: See below the equivalent in XML and JSON.
ja_jp: XMLとJSONでの同等のものは以下を参照してください。

source: See current increments keys
ja_jp: 現在のインクリメントキーの確認

source: See further information in xref:deploying-to-openshift.adoc[Deploying to OpenShift].
ja_jp: 詳細は xref:deploying-to-openshift.adoc[OpenShift へのデプロイ] を参照してください。

source: See https://github.com/quarkusio/quarkus/issues/26991[#26991] to track progress.
ja_jp: 進捗状況を追跡するには、 https://github.com/quarkusio/quarkus/issues/26991[#26991] を参照してください。

source: See https://github.com/quarkusio/quarkus/issues/39517[#39517] to track progress.
ja_jp: 進捗状況を追跡するには、 https://github.com/quarkusio/quarkus/issues/39517[#39517] を参照してください。

source: See https://hibernate.atlassian.net/browse/HSEARCH-5105[HSEARCH-5105] to track progress.
ja_jp: 進捗状況を追跡するには、 https://hibernate.atlassian.net/browse/HSEARCH-5105[HSEARCH-5105] を参照してください。

source: See https://podman-desktop.io/downloads/ for the latest version of Podman Desktop or pick the version that suits your operating system from the list below:
ja_jp: Podman Desktopの最新バージョンは https://podman-desktop.io/downloads/ 、または以下のリストからお使いのオペレーティングシステムに合ったバージョンをお選びください：

source: See https://podman-desktop.io/downloads/ for the latest version of Podman Desktop.
ja_jp: Podman Desktopの最新バージョンは https://podman-desktop.io/downloads/ を参照してください。

source: See https://quarkus.io/guides/rest-json#jackson for more details about how to go back to the previous behavior.
ja_jp: 前の動作に戻す方法については、 https://quarkus.io/guides/rest-json#jackson を参照してください。

source: See https://www.elastic.co/guide/en/elasticsearch/client/java-api-client/current/_encrypted_communication.html[Elasticsearch documentation] for more details on this particular example.
ja_jp: この例の詳細については、 https://www.elastic.co/guide/en/elasticsearch/client/java-api-client/current/_encrypted_communication.html[Elasticsearchのドキュメント] を参照してください。

source: See https://www.elastic.co/guide/en/elasticsearch/client/java-rest/current/_encrypted_communication.html[Elasticsearch documentation] for more details on this particular example.
ja_jp: この例の詳細については、 link:https://www.elastic.co/guide/en/elasticsearch/client/java-rest/current/_encrypted_communication.html[Elasticsearchのドキュメント] を参照してください。

source: See link:https://knative.dev/docs/serving/autoscaling/scale-bounds/#lower-bound[link]
ja_jp: link:https://knative.dev/docs/serving/autoscaling/scale-bounds/#lower-bound[リンク]参照

source: See link:https://knative.dev/docs/serving/autoscaling/scale-bounds/#upper-bound[link]
ja_jp: link:https://knative.dev/docs/serving/autoscaling/scale-bounds/#upper-bound[リンク]参照

source: See link:https://knative.dev/docs/serving/autoscaling/scale-to-zero/#enable-scale-to-zero[link]
ja_jp: link:https://knative.dev/docs/serving/autoscaling/scale-to-zero/#enable-scale-to-zero[リンク]参照

source: See link:https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus] for more information.
ja_jp: 詳細については、 link:https://quarkus.io/blog/path-resolution-in-quarkus/[Quarkusのパス解決] を参照してください。

source: See link:{concepts}#_counters[Counters] in the Micrometer documentation for more information and examples, including the less common `FunctionCounter` that can be used to measure the result returned by an always increasing function.
ja_jp: 詳細や例については、Micrometer ドキュメントの link:{concepts}#_counters[Counters] を参照してください。このドキュメントには、常に増加する関数によって返される結果を測定するために使用できる、あまり一般的ではない `FunctionCounter` についても説明されています。

source: See link:{concepts}#_gauges[Gauges] in the Micrometer documentation for more information and examples. Of note are two special cases: `TimeGauge` for measuring time, and a `MultiGauge` for reporting several criteria together.
ja_jp: 詳細と例については、Micrometer ドキュメントの link:{concepts}#_gauges[Gauges] を参照してください。 注目すべきは、時間を測定する `TimeGauge` と、複数の基準をまとめて報告する `MultiGauge` という 2 つの特殊なケースです。

source: See link:{concepts}/counters[Counters] in the Micrometer documentation for more information and examples, including the less common `FunctionCounter` that can be used to measure the result returned by an always increasing function.
ja_jp: 常時増加する関数が返す結果を測定するために使用できる、あまり一般的でない `FunctionCounter` を含む、より詳細な情報と例については、マイクロメータのドキュメントの link:{concepts}/counters[カウンタ] を参照してください。

source: See link:{concepts}/gauges[Gauges] in the Micrometer documentation for more information and examples. Of note are two special cases: `TimeGauge` for measuring time, and a `MultiGauge` for reporting several criteria together.
ja_jp: 詳細と例については、Micrometer ドキュメントの link:{concepts}/gauges[Gauges] を参照してください。 特筆すべきは2つの特別なケースです: 時間を測定するための `TimeGauge` と、いくつかの基準をまとめて報告するための `MultiGauge` です。

source: See link:{hibernate-search-doc-prefix}#mapper-orm-schema-management-manager[this section of the reference documentation] for more information.
ja_jp: 詳細については、 link:{hibernate-search-doc-prefix}#mapper-orm-schema-management-manager[Hibernate Searchのリファレンスドキュメントのこのセクション] を参照してください。

source: See link:{hibernate-search-docs-url}#schema-management-manager[this section of the reference documentation] for more information.
ja_jp: 詳細は、link:{hibernate-search-docs-url}#schema-management-manager[参照ドキュメントのこちらのセクション] を参照してください。

source: See link:{hibernate-search-orm-elasticsearch-aws-guide}#aws-configuration-reference[the documentation for the Hibernate Search ORM + Elasticsearch AWS extension] for more information.
ja_jp: 詳細は link:{hibernate-search-orm-elasticsearch-aws-guide}#aws-configuration-reference[Hibernate Search ORM + Elasticsearch AWS エクステンションのドキュメント] を参照してください。

source: See more about the `@AdaptToScalar` feature in the https://javadoc.io/static/io.smallrye/smallrye-graphql-api/1.5.0/io/smallrye/graphql/api/AdaptToScalar.html[JavaDoc].
ja_jp: `@ToScalar` の機能については、 link:https://javadoc.io/static/io.smallrye/smallrye-graphql-api/1.0.6/index.html?io/smallrye/graphql/api/ToScalar.html[JavaDoc] を参照してください。

source: See more about the `@ToScalar` feature in the https://javadoc.io/static/io.smallrye/smallrye-graphql-api/1.0.6/index.html?io/smallrye/graphql/api/ToScalar.html[JavaDoc].
ja_jp: `@ToScalar` の機能については、 link:https://javadoc.io/static/io.smallrye/smallrye-graphql-api/1.0.6/index.html?io/smallrye/graphql/api/ToScalar.html[JavaDoc] を参照してください。

source: See more about the `AdaptWith` feature in the https://javadoc.io/static/io.smallrye/smallrye-graphql-api/1.5.0/io/smallrye/graphql/api/AdaptWith.html[JavaDoc].
ja_jp: `AdaptWith` の機能については、 https://javadoc.io/static/io.smallrye/smallrye-graphql-api/1.5.0/io/smallrye/graphql/api/AdaptWith.html[JavaDoc] を参照してください。

source: See next section for more details
ja_jp: 詳細については、次のセクションを参照してください

source: See section <<configuration-reference>> for the list of properties you can set in `{config-file}`.
ja_jp: `{config-file}` で設定できるプロパティーのリストについては、<<configuration-reference>> のセクションを参照してください。

source: See section <<hr-configuration-properties,Hibernate Reactive configuration properties>> for the list of properties you can set in `{config-file}`.
ja_jp: `{config-file}` で設定できるプロパティの一覧は xref:hr-configuration-properties[Hibernate Reactive 設定プロパティ] を参照してください。

source: See section xref:hr-configuration-properties[Hibernate Reactive configuration properties] for the list of properties you can set in `{config-file}`.
ja_jp: `{config-file}` で設定できるプロパティの一覧は、xref:hr-configuration-properties[Hibernate Reactive 設定プロパティ] を参照してください。

source: See telemetry
ja_jp: テレメトリーを確認する

source: See the <<automated-migration>> section below for more information.
ja_jp: 詳しくは、下記の link:#automated-migration[自動マイグレーション] の項をご覧ください。

source: See the <<custom-java-script-request-checker>> section for details about customizing Java Script request checks.
ja_jp: JavaScript リクエストチェックのカスタマイズについての詳細は、 <<custom-java-script-request-checker>> セクションを参照してください。

source: See the <<custom-token-state-manager>> section for alternative methods of token storage.
ja_jp: トークン保存の代替方法については、<<custom-token-state-manager>> セクションを参照してください。

source: See the <<custom-token-state-manager>> section for alternative methods of token storage. This is ideal for those seeking customized solutions for token state management, especially when standard server-side storage does not meet your specific requirements.
ja_jp: トークン保存の代替方法については、<<custom-token-state-manager>> セクションを参照してください。これは特に、標準のサーバー側ストレージが要件を満たしていないなどの理由から、トークン状態管理のカスタマイズソリューションが必要な場合に最適です。

source: See the <<multi-tenancy>> section for more details.
ja_jp: 詳細は <<multi-tenancy>> セクションを参照してください。

source: See the <<negotiation>> section for more information.
ja_jp: 詳細は、<<negotiation>> セクションを参照してください。

source: See the <<tls-properties>> section if the MTLS authentication is required.
ja_jp: MTLS 認証が必要な場合は、<<tls-properties>> セクションを参照してください。

source: See the <<upgrading>> section for more information on how `quarkus update` helps you migrate.
ja_jp: `quarkus update` が移行を支援する方法については、 <<upgrading>> のセクションを参照してください。

source: See the Javadoc of `UniAsserter` for a full description of the various methods that can be used for creating assertions.
ja_jp: アサーション作成に使用できる様々なメソッドの詳細については、 `UniAsserter` の Javadoc を参照してください。

source: See the Micrometer documentation for additional advice on link:{concepts}#_tag_naming[tag naming].
ja_jp: 追加のアドバイスについては、Micrometer ドキュメントの {concepts}#_tag_naming[tag naming] を参照してください。

source: See the Micrometer documentation for additional advice on link:{concepts}/naming[tag naming].
ja_jp: link:{concepts}/naming[タグの命名] に関するその他のアドバイスについては、Micrometerのドキュメントを参照してください。

source: See the `RestClientWithTokenHeaderParam` declaration in the <<use-oidc-client-directly>> section.
ja_jp: <<use-oidc-client-directly>> セクションの `RestClientWithTokenHeaderParam` 宣言を参照してください。

source: See the data
ja_jp: Grafana-OTel-LGTM Dev サービスのデータを参照してください。

source: See the equivalent methods from the imperative example with the reactive variant:
ja_jp: リアクティブ バリアントを持つ命令型の例から、同等のメソッドを見てみましょう。

source: See the following documentation for Graylog (but the same issue exists for the other central logging stacks): link:https://docs.graylog.org/en/3.2/pages/configuration/elasticsearch.html#custom-index-mappings[Custom Index Mappings].
ja_jp: Graylogについては以下のドキュメントを参照してください（ただし、他のセントラルロギングスタックにも同じ問題があります）。 link:https://docs.graylog.org/en/3.2/pages/configuration/elasticsearch.html#custom-index-mappings[カスタム インデックス マッピング] 。

source: See the following sections for more information:
ja_jp: 詳細は、以下のセクションを参照してください。

source: See the http://quarkus.io/guides/http-reference#additional-http-headers[HTTP reference documentation] for more information.
ja_jp: 詳細は、 link:http://quarkus.io/guides/http-reference#additional-http-headers[HTTPリファレンスドキュメント]を参照してください。

source: See the https://github.com/qomponent/qui-code-block[@qomponent/qui-code-block] for more details.
ja_jp: 詳細については、 https://github.com/qomponent/qui-code-block[@qomponent/qui-code-block] を参照してください。

source: See the https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/controller/router-controller.js[controller] for some methods that might be useful.
ja_jp: 役立つ可能性のあるいくつかのメソッドについては、 https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/controller/router-controller.js[コントローラー] を参照してください。

source: See the https://github.com/quarkusio/quarkus/blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/controller/router-controller.js[controller] for some methods that might be useful.
ja_jp: https://github.com/quarkusio/quarkus/Blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/controller/router-controller.js[controller] には、役立ちそうなメソッドが記載されています。

source: See the https://github.com/quarkusio/quarkus/tree/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/state[current built-in] state objects.
ja_jp: https://github.com/quarkusio/quarkus/tree/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/state[現在の組み込み] 状態オブジェクトを参照してください。

source: See the https://javadoc.io/doc/io.smallrye/smallrye-graphql-api/latest/io/smallrye/graphql/api/Context.html[JavaDoc] for more details.
ja_jp: 詳細は link:https://javadoc.io/doc/io.smallrye/smallrye-graphql-api/latest/io/smallrye/graphql/api/Context.html[JavaDoc] を参照してください。

source: See the https://smallrye.io/smallrye-reactive-messaging/latest/concepts/message-context/[Message Context] documentation for further information.
ja_jp: 詳しくは link:https://smallrye.io/smallrye-reactive-messaging/latest/concepts/message-context/[Message Context] のドキュメントを参照してください。

source: See the https://www.ibm.com/support/knowledgecenter/SSEPGG_11.5.0/com.ibm.db2.luw.apdv.java.doc/src/tpc/imjcc_r0052342.html[official documentation] for more detail on URL syntax and additional supported options.
ja_jp: URL の構文やサポートされているオプションの詳細は、 link:https://www.ibm.com/support/knowledgecenter/SSEPGG_11.5.0/com.ibm.db2.luw.apdv.java.doc/src/tpc/imjcc_r0052342.html[公式ドキュメント] を参照してください。

source: See the javadoc of `QuarkusUnitTest#traceCategories` for details.
ja_jp: 詳細は、 `QuarkusUnitTest#traceCategories` の javadoc を参照してください。

source: See the main xref:opentelemetry.adoc#configuration-reference[OpenTelemetry Guide configuration] reference.
ja_jp: メインの xref:opentelemetry.adoc#configuration-reference[OpenTelemetry ガイド設定] リファレンスを参照してください。

source: See the main xref:opentelemetry.adoc#exporters[OpenTelemetry Guide exporters] section.
ja_jp: メインの xref:opentelemetry.adoc#exporters[OpenTelemetry ガイドのエクスポーター] セクションを参照してください。

source: See the main xref:opentelemetry.adoc#resource[OpenTelemetry Guide resources] section.
ja_jp: メインの xref:opentelemetry.adoc#resource[OpenTelemetry ガイドリソース] セクションを参照してください。

source: See the output
ja_jp: 出力を参照してください。

source: See the preceding <<keycloak-dev-mode,Running the application in Dev mode>> section for instructions on testing your application in development mode.
ja_jp: 開発モードでアプリケーションをテストする手順については、前述の <<keycloak-dev-mode,Running the application in Dev mode>> セクションを参照してください。

source: See the source of this controller https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/controller/notifier.js[here].
ja_jp: このコントローラーのソースは、 https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/controller/notifier.js[こちら] を参照してください。

source: See the source of this controller https://github.com/quarkusio/quarkus/blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/controller/notifier.js[here].
ja_jp: このコントローラーのソースについては、 https://github.com/quarkusio/quarkus/Blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/controller/notifier.js[こちら] を参照してください。

source: See the xref:container-image.adoc[Container Image guide] for more details.
ja_jp: 詳細については、 xref:container-image.adoc[コンテナーイメージガイド] を参照してください。

source: See the xref:http-reference#adoc[Supporting secure connections with SSL] guide for more information.
ja_jp: 詳しくは、 xref:http-reference.adoc#adoc[SSLによる安全な接続のサポート] ガイドをご覧ください。

source: See the xref:negotiation[Negotiation] section for more information.
ja_jp: 詳しくは xref:negotiation[ネゴシエーション] の項をご覧ください。

source: See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic.
ja_jp: このトピックの詳細については、xref:quarkus-reactive-architecture.adoc[Quarkus リアクティブアーキテクチャのドキュメント] を参照してください。

source: See the xref:rest-client-reactive.adoc[REST Client Reactive Guide] for more information about the reactive REST client.
ja_jp: リアクティブ・クライアントの詳細については、link:rest-client-reactive.html[REST Client Reactiveガイド] を参照してください。

source: See the xref:rest-client.adoc[REST Client Guide] for more information about the REST client.
ja_jp: REST クライアントの詳細については、 xref:rest-client.adoc[REST クライアントガイド] を参照してください。

source: See the xref:security-jwt.adoc[Using SmallRye JWT] guide for more information.
ja_jp: 詳細は、xref:security-jwt.adoc[Using SmallRye JWT] ガイドを参照してください。

source: See the xref:security-oauth2.adoc[Using OAuth2] guide for more information.
ja_jp: 詳細は、xref:security-oauth2.adoc[Using OAuth2] ガイドを参照してください。

source: See the xref:security-oidc-code-flow-authentication.adoc#single-page-applications[Integrating with SPA] documentation for more information about customizing JavaScript request checks with custom `quarkus.oidc.JavaScriptRequestChecker` request checkers.
ja_jp: カスタムの `quarkus.oidc.JavaScriptRequestChecker` リクエストチェッカーを使用した JavaScript リクエストチェックのカスタマイズに関する詳細は、 xref:security-oidc-code-flow-authentication.adoc#single-page-applications[SPA との統合] ドキュメントを参照してください。

source: See the xref:security-openid-connect-client.adoc[Using OpenID Connect and OAuth2 Client] guide for more information.
ja_jp: 詳しくは、 xref:security-openid-connect-client.adoc[OpenID ConnectとOAuth2クライアントの使用] ガイドをご覧ください。

source: See the xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Application] guide for more information about `Authorization Code Flow` authentication mechanism.
ja_jp: `Authorization Code Flow` 認証メカニズムの詳細については、xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Application] ガイドを参照してください。

source: See the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide for more information about `Bearer Token` authentication mechanism.
ja_jp: `Bearer Token` 認証メカニズムの詳細については、xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] ガイドを参照してください。

source: See the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide for more information about `Bearer Token` authentication mechanism. It is important to realize that it is the `Bearer Token` authentication mechanism which does the authentication and creates a security identity - while the `quarkus-keycloak-authorization` extension is responsible for applying a Keycloak Authorization Policy to this identity based on the current request path and other policy settings.
ja_jp: `Bearer Token` 認証メカニズムの詳細については、ガイド xref:security-openid-connect.adoc[OpenID Connectを利用したサービスアプリケーションの保護] を参照してください。認証を行い、セキュリティアイデンティティを作成するのは、 `Bearer Token` 認証メカニズムであり、一方、 `quarkus-keycloak-authorization` エクステンションは、現在のリクエストパスやその他のポリシー設定に基づいて、このアイデンティティにKeycloak Authorization Policyを適用する責任があることを認識することが重要です。

source: See the xref:writing-extensions.adoc#extension-philosophy[extension philosophy]. The xref:extension-maturity-matrix.adoc[extension maturity matrix] shows the kinds of capabilities extensions can offer. Another useful thing extensions can do is bundle other extensions. Have a look at the link:https://quarkus.io/extensions/io.quarkiverse.microprofile/quarkus-microprofile/[Quarkus MicroProfile extension] for an example of aggregator extensions.
ja_jp: xref:writing-extensions.adoc#extension-philosophy[エクステンションについて] を参照してください。 xref:extension-maturity-matrix.adoc[エクステンションの成熟度マトリックス] は、エクステンションが提供できる機能の種類を示しています。 エクステンションが実行できるもう 1 つの便利な機能は、他のエクステンションをバンドルすることです。 アグリゲーターエクステンションの例については、link:https://quarkus.io/extensions/io.quarkiverse.microprofile/quarkus-microprofile/[Quarkus MicroProfile エクステンション] を参照してください。

source: See xref:./tls-registry-reference.adoc#client-renegotiation[Preventing client renegotiation] for more information.
ja_jp: 詳細は、xref:./tls-registry-reference.adoc#client-renegotiation[クライアントの再ネゴシエーションの防止] を参照してください。

source: See xref:all-builditems.adoc[the complete list of BuildItem implementations in core] for more information
ja_jp: 詳細は、 link:all-builditems.html[コアのBuildItem実装の全リスト]を参照してください。

source: See xref:all-builditems.adoc[the complete list of BuildItem implementations in core] for more information.
ja_jp: 詳細については、xref:all-builditems.adoc[コアの BuildItem 実装の完全なリスト] を参照してください。

source: See xref:config-reference.adoc#with-environment-variables[this] for more information on how to combine properties with environment variables.
ja_jp: プロパティと環境変数を組み合わせる方法については、 link:config.html#combine-property-env-var[こちら]をご覧ください。

source: See xref:config.adoc#combine-property-env-var[this] for more information on how to combine properties with environment variables.
ja_jp: プロパティと環境変数を組み合わせる方法については、 link:config.html#combine-property-env-var[こちら]をご覧ください。

source: See xref:configuration-reference[Configuration Reference] for more information.
ja_jp: 詳しくは、 xref:configuration-reference[設定リファレンス] を参照してください。

source: See xref:customizing-the-vert-x-configuration[Customize the Vert.x configuration] to configure the Vert.x instance using a programmatic approach.
ja_jp: プログラム的なアプローチでVert.xインスタンスを設定するには、 xref:customizing-the-vert-x-configuration[Vert.x設定のカスタマイズ] を参照してください。

source: See xref:databases-dev-services.adoc[Databases Dev Services] for more details and optional configurations.
ja_jp: 詳細およびオプションの構成については、 link:databases-dev-services.html[Databases Dev Services] を参照してください。

source: See xref:deploying-to-kubernetes.adoc#secret-mapping[this] for more details.
ja_jp: 詳しくは xref:deploying-to-kubernetes.adoc#secret-mapping[こちら]をご覧ください。
